package Hometasks;

public class Hometask_02a {
    public static void main(String[] args) {
        /*
        Напиши программу, которая выводит на экран надпись:
        "Аварийное питание включено
        Ручное управление включено"
        Каждое предложение с новой строки.

        Пример вывода на экран:
        Аварийное питание включено
        Ручное управление включено

        Требования:
        •	Программа должна выводить текст.
        •	Текст должен начинаться с "Аварийное".
        •	Текст должен заканчиваться на "включено".
        •	Текст должен состоять из 2 строк.
        •	Выводимый текст должен соответствовать заданию.
         */

        System.out.println("Аварийное питание включено");
        System.out.println("Ручное управление включено");


    }
}
