package Hometasks;

public class Hometask_01a {
    public static void main(String[] args) {
        /*
        Напиши программу, которая выводит на экран надпись: "Диего + Амиго = Друзья".
        Пример вывода на экран:
        Диего + Амиго = Друзья

        Требования:
        • Программа должна выводить текст.
        • Текст должен начинаться с "Диего".
        • Текст должен заканчиваться на "Друзья".
        • Текст должен состоять из 22 символов, включая пробелы.
        • Выводимый текст должен соответствовать заданию.
        */

        System.out.println("Диего + Амиго = Друзья");
        System.out.print("Диего + Амиго");
        System.out.println(" = Друзья");



    }
}
